#+TITLE: floco
=floco= is a JavaScript package management and build tool powered by
[[https://nixos.org][Nix]].

=floco= is a bold departure from conventional JavaScript package management
tooling focusing on reproducibility, distributed caching, and sandboxing.

Every package is built in a strictly declared sandbox isolated from the runtime
system, much like an /OCI/ container.
This approach allows packages to be built once and reused on any system that
shares the same architecture and platform.
Artifacts are cached locally and may be distributed among a cluster of systems
allowing development environments to be created at more than twice the speed of
=npm= or =yarn=.

Underlying installers are implemented in =bash= and limit themselves to using
=coreutils=, =findutils=, and =jq= improving reproducibility and readability
compared to tooling implemented using a sprawling maze of JavaScript.

Despite this repository's seemingly small form, it is the result of nearly
a year of exploration, trial, and refinement.
A great deal of effort was expended to make this piece of software
/suck less/ than the competition, but rest assured that these routines were
not implemented naively.
Writing a JavaScript package management framework in =bash= and =nix= was
done /not because it is easy/ - on the contrary it was fucking hard.

** =install-module.sh=
This is used to install modules into a =node_modules/= directory or a
/FHS prefix/.
This routine is used internally by ~<floco>/builders/tree.nix~ but may also
be used as a regular executable for scripting outside of derivations.

#+BEGIN_SRC shell :exports both :results output
nix shell github:aakropotkin/floco#floco{,-utils};
# Downloads and unpacks a module from an identifier/descriptor.
dlmod() {
  export PKG="$1";
  floco eval --impure --raw --expr '( builtins.fetchTree {
    type = "tarball";
    url  = let
      res = builtins.npmResolve ( builtins.getEnv "PKG" );
      m   = builtins.match ".*\n([^\n]+)\n?" res;
    in if m == null then res else builtins.head m;
  } ).outPath';
}
# Hop into a temp area and install `semver' and its dependencies.
pushd "$( mktemp -d; )";
install-module.sh "$( dlmod "semver@7.3.8"; )" ./node_modules;
install-module.sh "$( dlmod "lru-cache@^6.0.0"; )" ./node_modules;
install-module.sh "$( dlmod "yallist@^4.0.0"; )" ./node_modules;
./node_modules/.bin/semver --help|head -n1;
TDIR="$PWD";
popd;
rm -rf "$TDIR";
#+END_SRC

#+RESULTS:
: SemVer 7.3.8

** =run-script.sh=
This is used to run a =package.json:.scripts.*= routine in the runtime
environment of ~node_modules/~.
This routine is equivalent to ~npm run~ or ~yarn run~.

Continuing the example above for =install-module.sh= ( before ~popd~ ),
we can replace ~./node_modules/.bin/semver --help|head -n1;~ with a script:
#+BEGIN_SRC shell :exports both :results output
# ...<SNIP>...
install-module.sh "$( dlmod "yallist@^4.0.0"; )" ./node_modules;

# Define and run a script.
echo '{
  "scripts": {
    "print-semver-version": "semver --help|head -n1",
    "print-node-version": "node --version"
  }
}' > ./package.json;
run-script.sh print-semver-version print-node-version;

TDIR="$PWD";
popd;
rm -rf "$TDIR";
#+END_SRC

#+RESULTS:
#+begin_example
SemVer 7.3.8
v18.12.1
#+end_example

**** =builtins.npmShow=
Wraps ~npm show~ allowing Nix to query package registries using a users
existing =npm= config and any environment =NPM_CONFIG_*= variables.

While =floco= is already able to fetch package registry information
without any external tools; this builtin is useful for accessing private
package registries and inheriting authorization settings with
minimal setup.

#+BEGIN_SRC shell :results output :exports both
nix run github:aakropotkin/floco#floco -- eval --json --expr '
builtins.attrNames ( builtins.npmShow "lodash" )
'|jq;
#+END_SRC

#+RESULTS:
#+begin_example
[
  "_cached",
  "_contentLength",
  "_hasShrinkwrap",
  "_id",
  "_nodeVersion",
  "_npmOperationalInternal",
  "_npmUser",
  "_npmVersion",
  "_rev",
  "author",
  "bugs",
  "contributors",
  "description",
  "directories",
  "dist",
  "dist-tags",
  "gitHead",
  "homepage",
  "icon",
  "keywords",
  "license",
  "main",
  "maintainers",
  "name",
  "readmeFilename",
  "repository",
  "scripts",
  "time",
  "users",
  "version",
  "versions"
]
#+end_example

**** =builtins.npmResolve=
Resolves package descriptors such as =foo@^1.0.0= or =bar@latest=
using =npm=, returning a resolved URI.

This has the same environment and configuration properties as =npmShow=.

NOTE: if you use ranges such as =lodash@2.x= you will want to use
=builtins.split= to parse the output.

#+BEGIN_SRC shell :results output :exports both
nix run github:aakropotkin/floco#floco -- eval --expr '
builtins.npmResolve "lodash@latest"
';
#+END_SRC

#+RESULTS:
: "https://registry.npmjs.org/lodash/-/lodash-4.17.21.tgz"

**** =builtins.npmLock=
Produces a virtual =package-lock.json= for a given project path
without modifying the project or making any writes to the filesystem.

This is an ideal alternative to the =fromRegistry= /updater/ when
used in combination with =builtins.fetchTree= and =builtins.npmResolve=.

In practice you can dynamically generate full dependency closures'
=treeInfo= records using this routine.
I currently use it for this purpose out in the field; but have avoided
using it in the default modules so that they are usable without plugins.

#+BEGIN_SRC shell :results output :exports both
nix run github:aakropotkin/floco#floco -- eval --impure --expr 'let
  url   = builtins.npmResolve "pacote@latest";
  src   = builtins.fetchTree { type = "tarball"; inherit url; };
  plock = builtins.npmLock src;
in builtins.attrNames plock
';
#+END_SRC

#+RESULTS:
: [ "lockfileVersion" "name" "packages" "requires" "version" ]

**** =builtins.semverSat=
Runs =node-semver= to test whether a semantic version satisfies
a constraint.
In the future =node-semver= will be replaced using a native C++ port
[[https://github.com/aakropotkin/semi.git][semi]].

This largely exists as a stop-gap until the pure =nix= implementation
from the alpha repository is polished and/or =semi= is completed.

#+BEGIN_SRC shell :results output :exports both
nix run github:aakropotkin/floco#floco -- eval --expr '[
  ( builtins.semverSat "^4.2.0" "4.0.0" )
  ( builtins.semverSat "^4.2.0" "4.2.0" )
  ( builtins.semverSat "^4.2.0" "4.2.1" )
  ( builtins.semverSat "^4.2.0" "4.3.0" )
]
';
#+END_SRC

#+RESULTS:
: [ false true true true ]


